test/load/06.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

-
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 30 ms │ 126 ms │ 513 ms │ 699 ms │ 175.57 ms │ 440.61 ms │ 9982 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 2,687   │ 2,687   │ 3,711   │ 4,151   │ 3,646.75 │ 336.63 │ 2,687   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 3.95 MB │ 3.95 MB │ 5.45 MB │ 6.09 MB │ 5.35 MB  │ 494 kB │ 3.94 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 72922 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 9            │
├────────────┼──────────────┤
│ 0.1        │ 20           │
├────────────┼──────────────┤
│ 1          │ 26           │
├────────────┼──────────────┤
│ 2.5        │ 30           │
├────────────┼──────────────┤
│ 10         │ 46           │
├────────────┼──────────────┤
│ 25         │ 82           │
├────────────┼──────────────┤
│ 50         │ 126          │
├────────────┼──────────────┤
│ 75         │ 145          │
├────────────┼──────────────┤
│ 90         │ 278          │
├────────────┼──────────────┤
│ 97.5       │ 513          │
├────────────┼──────────────┤
│ 99         │ 699          │
├────────────┼──────────────┤
│ 99.9       │ 7759         │
├────────────┼──────────────┤
│ 99.99      │ 9596         │
├────────────┼──────────────┤
│ 99.999     │ 9982         │
└────────────┴──────────────┘

74k requests in 20.09s, 107 MB read
195 errors (21 timeouts)

Process finished with exit code 0